app/views/layouts/_navigation.html.erb

            <ul class="dropdown-menu" role="menu">
              <% @user.categories.all.each do |cat| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "user_categories" ON "categories"."id" = "user_categories"."category_id" WHERE "user_categories"."user_id" = ?  [["user_id", 1]]